[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:58:38
               id="itemId"
               type="number"
               isInvalid={Boolean(errors.itemId)}
-              {...register("itemId", {
-                required: true,
-                min: 1,
-              })}
+              {...register("itemId", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: menuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Item ID must be an integer greater than 1/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:64:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.itemId && "Item ID is required. "}
+              {errors.itemId || "Item ID is required. "}
               {errors.itemId?.type === "min" &&
                 "Item ID must be an integer greater than 1"}
killedBy: menuItemReviewForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Item ID/

Here are the matching elements:

Ignored nodes: comments, script, style
<label
  class="form-label"
  for="itemId"

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:64:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.itemId && "Item ID is required. "}
+              {true}
               {errors.itemId?.type === "min" &&
                 "Item ID must be an integer greater than 1"}
killedBy: menuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Item ID is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.js:65:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.itemId && "Item ID is required. "}
-              {errors.itemId?.type === "min" &&
+              {errors.itemId.type === "min" &&
                 "Item ID must be an integer greater than 1"}
             </Form.Control.Feedback>
killedBy: menuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:65:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.itemId && "Item ID is required. "}
-              {errors.itemId?.type === "min" &&
-                "Item ID must be an integer greater than 1"}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: menuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Item ID must be an integer greater than 1/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:66:17
             <Form.Control.Feedback type="invalid">
               {errors.itemId && "Item ID is required. "}
               {errors.itemId?.type === "min" &&
-                "Item ID must be an integer greater than 1"}
+                ""}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: menuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Item ID must be an integer greater than 1/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:84:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.reviewerEmail && "Reviewer email is required. "}
+              {true}
               {errors.reviewerEmail?.type === "pattern" &&
                 "Must input valid reviewer email"}
killedBy: menuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] EqualityOperator
main/components/MenuItemReview/MenuItemReviewForm.js:85:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.reviewerEmail && "Reviewer email is required. "}
-              {errors.reviewerEmail?.type === "pattern" &&
+              {errors.reviewerEmail?.type !== "pattern" &&
                 "Must input valid reviewer email"}
             </Form.Control.Feedback>
killedBy: menuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Must input valid reviewer email/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:85:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.reviewerEmail && "Reviewer email is required. "}
-              {errors.reviewerEmail?.type === "pattern" &&
-                "Must input valid reviewer email"}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: menuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Must input valid reviewer email/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:108:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.stars && "Stars is required. "}
+              {errors.stars || "Stars is required. "}
               {(errors.stars?.type === "min" || errors.stars?.type === "max") &&
                 "Must give a rating between 0 and 5 stars"}
killedBy: menuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:108:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.stars && "Stars is required. "}
+              {true}
               {(errors.stars?.type === "min" || errors.stars?.type === "max") &&
                 "Must give a rating between 0 and 5 stars"}
killedBy: menuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:109:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.stars && "Stars is required. "}
-              {(errors.stars?.type === "min" || errors.stars?.type === "max") &&
-                "Must give a rating between 0 and 5 stars"}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: menuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Must give a rating between 0 and 5 stars/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:109:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.stars && "Stars is required. "}
-              {(errors.stars?.type === "min" || errors.stars?.type === "max") &&
-                "Must give a rating between 0 and 5 stars"}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: menuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Must give a rating between 0 and 5 stars/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:110:17
             <Form.Control.Feedback type="invalid">
               {errors.stars && "Stars is required. "}
               {(errors.stars?.type === "min" || errors.stars?.type === "max") &&
-                "Must give a rating between 0 and 5 stars"}
+                ""}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: menuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Must give a rating between 0 and 5 stars/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
