[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:51:15
       accessor: "stars",
     },
     {
-      Header: "Date (iso format)",
+      Header: "",
       accessor: "dateReviewed",
     },
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Date (iso format). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
