[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:20:33
     },
   });
 
-  const onSuccess = (review) => {
-    toast(
-      `New Menu Item Review Created - id: ${review.id} itemId: ${review.itemId}`,
-    );
-  };
+  const onSuccess = (review) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuitemreview
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Menu Item Review Created - id: 5 itemId: 6"

Number of calls: 0
