[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewEditPage.js:43:33
     },
   });
 
-  const onSuccess = (review) => {
-    toast(
-      `Menu Item Review Updated - id: ${review.id} itemId: ${review.itemId}`,
-    );
-  };
+  const onSuccess = (review) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/pages/MenuItemReview/MenuItemReviewEditPage.js:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Menu Item Review</h1>
-        {review && (
-          <MenuItemReviewForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={review}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/MenuItemReview/MenuItemReviewEditPage.js:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Menu Item Review</h1>
-        {review && (
-          <MenuItemReviewForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={review}
-          />
-        )}
+        {review || <MenuItemReviewForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={review} />}
       </div>
     </BasicLayout>
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, itemId, reviewerEmail, stars, dateReviewed, comments}). If you meant to render a collection of children, use an array instead.
