[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:31:35
           id="orgCode"
           type="text"
           isInvalid={Boolean(errors.orgCode)}
-          {...register("orgCode", {
-            required: "Org Code is required.",
-          })}
+          {...register("orgCode", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Org Code is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
