[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.js:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/ucsborganization/edit/${cell.row.values.orgCode}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsborganization/edit/cdt"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/ucsborganization/edit/${cell.row.values.orgCode}`);
+    navigate(``);
   };
 
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsborganization/edit/cdt"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:46:17
 
     {
       Header: "Org Translation Short",
-      accessor: "orgTranslationShort",
+      accessor: "",
     },
     {
killedBy: UCSBOrganizationIndexPage tests renders threeOrganizations correctly for regular user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Chi Delts. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:52:5
       Header: "Org Translation",
       accessor: "orgTranslation",
     },
-    {
-      Header: "Inactive",
-      accessor: "inactive",
-      // Organizations: ({ organizations }) =>
-      //   organizations.row.original.inactive.toString(),
-    },
+    {},
   ];
   // (organizations) => organizations.inactive.toString(),
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:54:17
     },
     {
       Header: "Inactive",
-      accessor: "inactive",
+      accessor: "",
       // Organizations: ({ organizations }) =>
       //   organizations.row.original.inactive.toString(),
killedBy: UCSBOrganizationIndexPage tests renders threeOrganizations correctly for regular user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-inactive"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationTable.js:60:7
     },
   ];
   // (organizations) => organizations.inactive.toString(),
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
+  if (true) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
     columns.push(
killedBy: UCSBOrganizationIndexPage tests renders threeOrganizations correctly for regular user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-danger" data-testid="UCSBOrganizationTable-cell-row-0-col-Delete-button" type="button">Delete</button> instead

[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.js:60:43
     },
   ];
   // (organizations) => organizations.inactive.toString(),
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return (
killedBy: UCSBOrganizationIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
