[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function UCSBOrganizationCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (organization) => ({
-    url: "/api/ucsborganization/post",
-    method: "POST",
-    params: {
-      orgCode: organization.orgCode,
-      orgTranslationShort: organization.orgTranslationShort,
-      orgTranslation: organization.orgTranslation,
-      inactive: organization.inactive,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (organization) => {
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:8:50
 import { toast } from "react-toastify";
 
 export default function UCSBOrganizationCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (organization) => ({
-    url: "/api/ucsborganization/post",
-    method: "POST",
-    params: {
-      orgCode: organization.orgCode,
-      orgTranslationShort: organization.orgTranslationShort,
-      orgTranslation: organization.orgTranslation,
-      inactive: organization.inactive,
-    },
-  });
+  const objectToAxiosParams = (organization) => ({});
 
   const onSuccess = (organization) => {
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:19:39
     },
   });
 
-  const onSuccess = (organization) => {
-    toast(`New UCSBOrganization Created - Org Code: ${organization.orgCode}`);
-  };
+  const onSuccess = (organization) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New UCSBOrganization Created - Org Code: zpr"

Number of calls: 0

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:20:11
   });
 
   const onSuccess = (organization) => {
-    toast(`New UCSBOrganization Created - Org Code: ${organization.orgCode}`);
+    toast(``);
   };
 
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New UCSBOrganization Created - Org Code: zpr"
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:36:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/ucsborganization" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"to": "/ucsborganization"}

Number of calls: 0
