[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.js:19:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/ucsborganization/all"],
-    { method: "GET", url: "/api/ucsborganization/all" },
+    {},
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: UCSBOrganizationIndexPage tests renders threeOrganizations correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.js:19:27
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/ucsborganization/all"],
-    { method: "GET", url: "/api/ucsborganization/all" },
+    { method: "GET", url: "" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: UCSBOrganizationIndexPage tests renders threeOrganizations correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.js:24:30
     [],
   );
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/ucsborganization/create" // Corrected URL path
-          style={{ float: "right" }}
-        >
-          Create UCSBOrganization
-        </Button>
-      );
-    }
-    return null; // Return null if the user is not an admin
-  };
+  const createButton = () => {};
 
   return (
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create UCSBOrganization/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.js:25:45
   );
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/ucsborganization/create" // Corrected URL path
-          style={{ float: "right" }}
-        >
-          Create UCSBOrganization
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
     return null; // Return null if the user is not an admin
   };
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create UCSBOrganization/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.js:30:18
         <Button
           variant="primary"
           href="/ucsborganization/create" // Corrected URL path
-          style={{ float: "right" }}
+          style={{}}
         >
           Create UCSBOrganization
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
