[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:64:38
               id="itemId"
               type="text"
               isInvalid={Boolean(errors.itemId)}
-              {...register("itemId", {
-                required: true,
-                pattern: integer_regex,
-              })}
+              {...register("itemId", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: menuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Item ID must be an integer, e.g. 1 for item #1/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:70:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.itemId && "Item ID is required"}
+              {errors.itemId || "Item ID is required"}
               {errors.itemId?.type === "pattern" &&
                 "Item ID must be an integer, e.g. 1 for item #1"}
killedBy: menuItemReviewForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Item ID/

Here are the matching elements:

Ignored nodes: comments, script, style
<label
  class="form-label"
  for="itemID"

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:70:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.itemId && "Item ID is required"}
+              {true}
               {errors.itemId?.type === "pattern" &&
                 "Item ID must be an integer, e.g. 1 for item #1"}
killedBy: menuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Item ID is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:71:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.itemId && "Item ID is required"}
-              {errors.itemId?.type === "pattern" &&
-                "Item ID must be an integer, e.g. 1 for item #1"}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: menuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Item ID must be an integer, e.g. 1 for item #1/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.js:71:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.itemId && "Item ID is required"}
-              {errors.itemId?.type === "pattern" &&
+              {errors.itemId.type === "pattern" &&
                 "Item ID must be an integer, e.g. 1 for item #1"}
             </Form.Control.Feedback>
killedBy: menuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:72:17
             <Form.Control.Feedback type="invalid">
               {errors.itemId && "Item ID is required"}
               {errors.itemId?.type === "pattern" &&
-                "Item ID must be an integer, e.g. 1 for item #1"}
+                ""}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: menuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Item ID must be an integer, e.g. 1 for item #1/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:90:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.reviewerEmail && "Reviewer email is required"}
+              {errors.reviewerEmail || "Reviewer email is required"}
               {errors.reviewerEmail?.type === "pattern" &&
                 "Must input valid reviewer email"}
killedBy: menuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:90:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.reviewerEmail && "Reviewer email is required"}
+              {true}
               {errors.reviewerEmail?.type === "pattern" &&
                 "Must input valid reviewer email"}
killedBy: menuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:91:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.reviewerEmail && "Reviewer email is required"}
-              {errors.reviewerEmail?.type === "pattern" &&
-                "Must input valid reviewer email"}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: menuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Must input valid reviewer email/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.js:91:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.reviewerEmail && "Reviewer email is required"}
-              {errors.reviewerEmail?.type === "pattern" &&
+              {errors.reviewerEmail.type === "pattern" &&
                 "Must input valid reviewer email"}
             </Form.Control.Feedback>
killedBy: menuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:113:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.stars && "Stars is required"}
+              {true}
               {errors.stars?.type === "pattern" &&
                 "Must give a rating between 0 and 5 stars"}
killedBy: menuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:113:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.stars && "Stars is required"}
+              {false}
               {errors.stars?.type === "pattern" &&
                 "Must give a rating between 0 and 5 stars"}
killedBy: menuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:114:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.stars && "Stars is required"}
-              {errors.stars?.type === "pattern" &&
-                "Must give a rating between 0 and 5 stars"}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: menuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Must give a rating between 0 and 5 stars/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:114:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.stars && "Stars is required"}
-              {errors.stars?.type === "pattern" &&
+              {true &&
                 "Must give a rating between 0 and 5 stars"}
             </Form.Control.Feedback>
killedBy: menuItemReviewForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Must give a rating between 0 and 5 stars</div> instead

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:133:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateReviewed && "DateReviewed is required"}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: menuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /DateReviewed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:148:40
               id="comments"
               type="text"
               isInvalid={Boolean(errors.comments)}
-              {...register("comments", {
-                required: "Comments is required",
-              })}
+              {...register("comments", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: menuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
