[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:58:38
               id="itemId"
               type="number"
               isInvalid={Boolean(errors.itemId)}
-              {...register("itemId", {
-                required: true,
-                valueAsNumber: true,
-                min: 1,
-              })}
+              {...register("itemId", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: menuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Item ID must be an integer greater than 1/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:60:32
               isInvalid={Boolean(errors.itemId)}
               {...register("itemId", {
                 required: true,
-                valueAsNumber: true,
+                valueAsNumber: false,
                 min: 1,
               })}
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuitemreview
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "comments": "splendid!",
    "dateReviewed": "2024-05-07T05:05:05.000",

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:66:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.itemId && "Item ID is required. "}
-              {errors.itemId?.type === "min" &&
+              {true &&
                 "Item ID must be an integer greater than 1"}
             </Form.Control.Feedback>
killedBy: menuItemReviewForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Item ID/

Here are the matching elements:

Ignored nodes: comments, script, style
<label
  class="form-label"
  for="itemId"

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:86:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.reviewerEmail && "Reviewer email is required. "}
-              {errors.reviewerEmail?.type === "pattern" &&
-                "Must input valid reviewer email"}
+              {errors.reviewerEmail?.type === "pattern" || "Must input valid reviewer email"}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: menuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Must input valid reviewer email/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:86:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.reviewerEmail && "Reviewer email is required. "}
-              {errors.reviewerEmail?.type === "pattern" &&
-                "Must input valid reviewer email"}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: menuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Must input valid reviewer email/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:87:17
             <Form.Control.Feedback type="invalid">
               {errors.reviewerEmail && "Reviewer email is required. "}
               {errors.reviewerEmail?.type === "pattern" &&
-                "Must input valid reviewer email"}
+                ""}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: menuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Must input valid reviewer email/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:110:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.stars && "Stars is required. "}
+              {false}
               {(errors.stars?.type === "min" || errors.stars?.type === "max") &&
                 "Must give a rating between 0 and 5 stars"}
killedBy: menuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.js:111:17
             />
             <Form.Control.Feedback type="invalid">
               {errors.stars && "Stars is required. "}
-              {(errors.stars?.type === "min" || errors.stars?.type === "max") &&
+              {(errors.stars.type === "min" || errors.stars?.type === "max") &&
                 "Must give a rating between 0 and 5 stars"}
             </Form.Control.Feedback>
killedBy: menuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:111:17
             />
             <Form.Control.Feedback type="invalid">
               {errors.stars && "Stars is required. "}
-              {(errors.stars?.type === "min" || errors.stars?.type === "max") &&
+              {(false || errors.stars?.type === "max") &&
                 "Must give a rating between 0 and 5 stars"}
             </Form.Control.Feedback>
killedBy: menuItemReviewForm tests Correct Error messsages on negative Stars
statusReason: Error: Unable to find an element with the text: /Must give a rating between 0 and 5 stars/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
