[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:30:34
     },
   );
 
-  const objectToAxiosPutParams = (diningCommonsMenuItem) => ({
-    url: "/api/ucsbdiningcommonsmenuitem",
-    method: "PUT",
-    params: {
-      id: diningCommonsMenuItem.id,
-    },
-    data: {
-      diningCommonsCode: diningCommonsMenuItem.diningCommonsCode,
-      name: diningCommonsMenuItem.name,
-      station: diningCommonsMenuItem.station,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (diningCommonsMenuItem) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDiningCommonsMenuItem Updated - id: 17 name: Fried Chicken"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:30:62
     },
   );
 
-  const objectToAxiosPutParams = (diningCommonsMenuItem) => ({
-    url: "/api/ucsbdiningcommonsmenuitem",
-    method: "PUT",
-    params: {
-      id: diningCommonsMenuItem.id,
-    },
-    data: {
-      diningCommonsCode: diningCommonsMenuItem.diningCommonsCode,
-      name: diningCommonsMenuItem.name,
-      station: diningCommonsMenuItem.station,
-    },
-  });
+  const objectToAxiosPutParams = (diningCommonsMenuItem) => ({});
 
   const onSuccess = (diningCommonsMenuItem) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDiningCommonsMenuItem Updated - id: 17 name: Fried Chicken"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:43:48
     },
   });
 
-  const onSuccess = (diningCommonsMenuItem) => {
-    toast(
-      `UCSBDiningCommonsMenuItem Updated - id: ${diningCommonsMenuItem.id} name: ${diningCommonsMenuItem.name}`,
-    );
-  };
+  const onSuccess = (diningCommonsMenuItem) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:45:7
 
   const onSuccess = (diningCommonsMenuItem) => {
     toast(
-      `UCSBDiningCommonsMenuItem Updated - id: ${diningCommonsMenuItem.id} name: ${diningCommonsMenuItem.name}`,
+      ``,
     );
   };
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDiningCommonsMenuItem Updated - id: 17 name: Fried Chicken"
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDiningCommonsMenuItem</h1>
-        {diningCommonsMenuItem && (
-          <UCSBDiningCommonsMenuItemForm
-            initialContents={diningCommonsMenuItem}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-diningCommonsCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDiningCommonsMenuItem</h1>
-        {diningCommonsMenuItem && (
-          <UCSBDiningCommonsMenuItemForm
-            initialContents={diningCommonsMenuItem}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {diningCommonsMenuItem || <UCSBDiningCommonsMenuItemForm initialContents={diningCommonsMenuItem} submitAction={onSubmit} buttonLabel="Update" />}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonsMenuItemEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="UCSBDiningCommonsMenuItemForm-diningCommonsCode" id="diningCommonsCode" name="diningCommonsCode" type="text" /> instead
