[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.js:33:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/ucsbdiningcommonsmenuitem/all"],
-    { method: "GET", url: "/api/ucsbdiningcommonsmenuitem/all" },
+    {},
     [],
   );
killedBy: UCSBDiningCommonsMenuItemIndexPage tests renders three items correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
