[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:34:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Col>
-          <Form.Group className="mb-3">
-            <Form.Label htmlFor="id">Id</Form.Label>
-            <Form.Control
-              data-testid="RecommendationRequestForm-id"
-              id="id"
-              type="text"
-              {...register("id")}
-              value={initialContents.id}
-              disabled
-            />
-          </Form.Group>
-        </Col>
-      )}
+      {initialContents || <Col>
+          <Form.Group className="mb-3">
+            <Form.Label htmlFor="id">Id</Form.Label>
+            <Form.Control data-testid="RecommendationRequestForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+          </Form.Group>
+        </Col>}
 
       <Form.Group className="mb-3">
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:34:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Col>
-          <Form.Group className="mb-3">
-            <Form.Label htmlFor="id">Id</Form.Label>
-            <Form.Control
-              data-testid="RecommendationRequestForm-id"
-              id="id"
-              type="text"
-              {...register("id")}
-              value={initialContents.id}
-              disabled
-            />
-          </Form.Group>
-        </Col>
-      )}
+      {false}
 
       <Form.Group className="mb-3">
killedBy: RecommendationRequestForm tests renders correctly when passing in a RecommendationRequest
statusReason: Error: Unable to find an element by: [data-testid="/RecommendationRequestForm-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:57:42
           id="requesterEmail"
           type="text"
           isInvalid={Boolean(errors.requesterEmail)}
-          {...register("requesterEmail", {
-            required: "Requester Email is required. ",
-            pattern: {
-              value: email_regex,
-              message: "Please enter a valid email address.",
-            },
-          })}
+          {...register("requesterEmail", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Please enter a valid email address./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:79:22
           isInvalid={Boolean(errors.professorEmail)}
           {...register("professorEmail", {
             required: "Professor Email is required. ",
-            pattern: {
-              value: email_regex,
-              message: "Please enter a valid email address.",
-            },
+            pattern: {},
           })}
         />
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Please enter a valid email address./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
