[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:82:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.station && "Station is required."}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBDiningCommonsMenuItem tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Station is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:98:27
               type="text"
               isInvalid={Boolean(errors.name)}
               {...register("name", {
-                required: true,
+                required: false,
               })}
             />
killedBy: UCSBDiningCommonsMenuItem tests Correct Error messsages on missing input
statusReason: TypeError: e is not a function

[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:102:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.name && "Name is required."}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBDiningCommonsMenuItem tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Name is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:102:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.name && "Name is required."}
+              {errors.name || "Name is required."}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBDiningCommonsMenuItem tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.
