[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:10:31
 export default function UCSBDiningCommonsMenuItemCreatePage({
   storybook = false,
 }) {
-  const objectToAxiosParams = (UCSBDiningCommonsMenuItem) => ({
-    url: "/api/ucsbdiningcommonsmenuitem/post",
-    method: "POST",
-    params: {
-      diningCommonsCode: UCSBDiningCommonsMenuItem.diningCommonsCode,
-      name: UCSBDiningCommonsMenuItem.name,
-      station: UCSBDiningCommonsMenuItem.station,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (UCSBDiningCommonsMenuItem) => {
killedBy: UCSBDiningCommonsMenuItemCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:20:52
     },
   });
 
-  const onSuccess = (UCSBDiningCommonsMenuItem) => {
-    toast(
-      `New UCSBDiningCommonsMenuItem Created - id: ${UCSBDiningCommonsMenuItem.id} name: ${UCSBDiningCommonsMenuItem.name}`,
-    );
-  };
+  const onSuccess = (UCSBDiningCommonsMenuItem) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New UCSBDiningCommonsMenuItem Created - id: 17 name: Chicken Caesar Salad"

Number of calls: 0
